12/data/attachments/c8e12e50eca64a5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_67b0f2e2-c6c3-4055-a03d-39e9a1ce6a9f</nif:username>
            <nif:friendToBeAdded>Steven_majority_Friend_80705_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>